Revit 2024 API
ExternalResourceSubFolder Class
 Data that describes a remote folder to be shown in the file browser dialog
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public class ExternalResourceSubFolder : IDisposable
Visual Basic
Public Class ExternalResourceSubFolder _
	Implements IDisposable
Visual C++
public ref class ExternalResourceSubFolder : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceSubFolder
See Also
ExternalResourceSubFolder Members
Autodesk.Revit.DB Namespace